[
  {
    "name": "VicTsing Wireless Mouse,",
    "description": "After thousands of samples of palm data, we designed this ergonomic mouse. The laptop mouse has a streamlined arc and thumb rest to help reduce the stress caused by prolonged use of the laptop mouse.",
    "rating": 3,
    "price": 10.99,
    "quantity": 9,
    "category": "Laptop Accessories"
  },
  {
    "name": "Bose Frames Tenor - Rectangular Polarized, Bluetooth Audio Sunglasses",
    "description": "Redesigned for luxury — Thoughtfully refined and strikingly elegant, the latest Bose sunglasses blend enhanced features and designs for an elevated way to listen",
    "rating": 4,
    "price": 249,
    "quantity": 81,
    "category": "Speaker"
  },
  {
    "name": "Willful Smart Watch for Men Women 2020,",
    "description": "Are you looking for a smart watch, which can not only easily keep tracking of your steps, calories, heart rate and sleep quality, but also keep you informed of incoming calls.",
    "rating": 5,
    "price": 29.99,
    "quantity": 69,
    "category": "Smart Watch"
  },
  {
    "name": "Ronyes Unisex College Bag Bookbags for Women",
    "description": "Made of high quality water-resistant material, padded and adjustable shoulder straps, external USB with built-in charging cable offers a convenient charging",
    "rating": 2,
    "price": 23.99,
    "quantity": 78,
    "category": "Handbags"
  },
  {
    "name": "Toshiba Canvio Advance 2TB Portable External Hard Drive",
    "description": "Up to 3TB of storage capacity to store your growing files and content",
    "rating": 2,
    "price": 69.99,
    "quantity": 78,
    "category": "Electronic Accessories"
  },
  {
    "name": "Tile Pro - High Performance Bluetooth Tracker",
    "description": "FIND KEYS, BAGS & MORE -- Pro is our high-performance finder ideal for keys, backpacks, luggage or any other items you want to keep track of. The easy-to-use finder and free app work with iOS and Android.",
    "rating": 4,
    "price": 29.99,
    "quantity": 4,
    "category": "Mobile Accessories"
  },
  {
    "name": "Bugani M90 Portable Bluetooth Speaker",
    "description": "Bluetooth Speakers-The M90 Bluetooth speaker uses the latest Bluetooth 5.0 technology and the latest Bluetooth ATS chip, Connecting over Bluetooth in seconds to iPhone, iPad, Smart-phones, Tablets, Windows, and other Bluetooth devices.",
    "rating": 3,
    "price": 56,
    "quantity": 91,
    "category": "Mobile Accessories"
  },
  {
    "name": "PlayStation 4 Console",
    "description": "All the greatest, games, TV, music and more. Connect with your friends to broadcast and celebrate your epic moments at the press of the Share button to Twitch, YouTube, Facebook and Twitter.",
    "rating": 4,
    "price": 339.95,
    "quantity": 50,
    "category": "Gaming Device"
  },
  {
    "name": "Giotto 32oz Leakproof BPA Free Drinking Water",
    "description": "With unique inspirational quote and time markers on it,this water bottle is great for measuring your daily intake of water,reminding you stay hydrated and drink enough water throughout the day.A must have for any fitness goals including weight loss,appetite control and overall health.",
    "rating": 4,
    "price": 16.99,
    "quantity": 39,
    "category": "Home Appliances"
  },
  {
    "name": "Oculus Quest All-in-one VR",
    "description": "All-in-one VR: No PC. No wires. No limits. Oculus quest is an all-in-one gaming system built for virtual reality. Now you can play almost anywhere with just a VR headset and controllers. Oculus touch controllers: arm yourself with the award-winning Oculus touch controllers. Your slashes, throws and grab appear in VR with intuitive, realistic Precision, transporting your hands and gestures right into the game",
    "rating": 1,
    "price": 645,
    "quantity": 98,
    "category": "VR Device"
  },
  {
    "name": "Handbags for Women Large Designer bag",
    "description": "Classic Hobo Purse: Top zipper closure, with 2 side zipper pockets design and elegant tassels decoration, fashionable and practical handbags for women, perfect for shopping, dating, travel and business",
    "rating": 3,
    "price": 39.99,
    "quantity": 15,
    "category": "Handbags"
  },
  {
    "name": "Adidas Mens Tech Response Shoes",
    "description": "Comfort + performance.  Designed with materials that are durable, lightweight and extremely comfortable. Core performance delivers the perfect mix of fit, style and all-around performance.",
    "rating": 5,
    "price": 54.59,
    "quantity": 29,
    "category": "Shoes"
  },
  {
    "name": "Laptop Bag",
    "description": "TSA FRIENDLY- A separate DIGI SMART compartment can hold 15.6 inch Laptop as well as 15 inch, 14 inch Macbook, 12.9 inch iPad, and tech accessories like charger for quick TSA checkpoint when traveling",
    "rating": 5,
    "price": 29.99,
    "quantity": 20,
    "category": "Laptop Accessories"
  },
  {
    "name": "Wireless Charger 5W Max",
    "description": "Charge with case: transmits charging power directly through protective cases. Rubber/plastic/TPU cases under 5 mm thickness . Do not use any magnetic and metal attachments or cards, or it will prevent charging.",
    "rating": 3,
    "price": 10.83,
    "quantity": 32,
    "category": "Mobile Accessories"
  },
  {
    "name": "Vankyo leisure 3 mini projector",
    "description": "SUPERIOR VIEWING EXPERIENCE: Supporting 1920x1080 resolution, VANKYO Leisure 3 projector is powered by MStar Advanced Color Engine, which is ideal for home entertainment. 2020 upgraded LED lighting provides a superior viewing experience for you.",
    "rating": 2,
    "price": 99.99,
    "quantity": 81,
    "category": "Projector"
  },
  {
    "name": "New Apple iPad Pro",
    "description": "Up to 10 hours of surﬁng the web on Wi‑Fi, watching video, or listening to music. Up to 9 hours of surﬁng the web using cellular data network, Compatible with Smart Keyboard Folio and Bluetooth keyboards",
    "rating": 3,
    "price": 799.99,
    "quantity": 60,
    "category": "Tablet"
  },
  {
    "name": "Nike Air Max",
    "description": "With a bold application of colorblocking inspired by modern art styles, the Nike Air Max 270 React sneaker is constructed with layers of lightweight material to achieve its artful look and comfortable feel.",
    "rating": 5,
    "price": 81.99,
    "quantity": 78,
    "category": "Shoes"
  },
  {
    "name": "Logitech K380 Wireless Keyboard",
    "description": "Logitech K380 Bluetooth Wireless Keyboard gives you the comfort and convenience of desktop typing on your smartphone, and tablet. It is a wireless keyboard that connects to all Bluetooth wireless devices that support external keyboards. Take this compact, lightweight, Bluetooth keyboard anywhere in your home. Type wherever you like, on any compatible computer, phone or tablet.",
    "rating": 4,
    "price": 81.99,
    "quantity": 91,
    "category": "Mobile Accessories"
  },
  {
    "name": "OnePlus 7 Pro ",
    "description": "The OnePlus 7 Pro features a brand new design, with a glass back and front and curved sides. The phone feels    very premium but’s it’s also very heavy. The Nebula Blue variant looks slick but it’s quite slippery, which    makes single-handed use a real challenge. It has a massive 6.67-inch ‘Fluid AMOLED’ display with a QHD+    resolution, 90Hz refresh rate and support for HDR 10+ content. The display produces vivid colours, deep blacks    and has good viewing angles.",
    "rating": 4,
    "price": 14.99,
    "quantity": 61,
    "category": "Mobile Phone"
  },
  {
    "name": "Sony 4K Ultra HD LED TV ",
    "description": "Sony 4K Ultra HD LED TV has 4K HDR Support. The TV provides clear visuals and provides distinct sound quality    and an immersive experience. This TV has Yes HDMI ports & Yes USB ports. Connectivity options included are HDMI.    You can connect various gadgets such as your laptop using the HDMI port. The TV comes with a 1 Year warranty.",
    "rating": 5,
    "price": 7999.99,
    "quantity": 64,
    "category": "TV"
  },
  {
    "name": "Google - Google Home - White/Slate fabric",
    "description": "Simplify your everyday life with the Google Home, a voice-activated speaker powered by the Google Assistant. Use    voice commands to enjoy music, get answers from Google and manage everyday tasks. Google Home is compatible with    Android and iOS operating systems, and can control compatible smart devices such as Chromecast or Nest.",
    "rating": 4,
    "price": 129.29,
    "quantity": 18,
    "category": "Electronic Accessories"
  },
  {
    "name": "Switch Pro Controller",
    "description": "The Nintendo Switch Pro Controller is one of the pricies baseline  controllers in the current console    generation, but it's also sturdy, feels good to play with, has an excellent direction pad, and features    impressive motion sensors and vibration systems. On top of all of that, it uses Bluetooth, so you don't need an    adapter to use it with your PC.",
    "rating": 3,
    "price": 429.99,
    "quantity": 11,
    "category": "Gaming Device"
  },
  {
    "name": "Apple - MacBook Air® (Latest Model) - 13.3\" Display - Silver",
    "description": "MacBook Air is a thin, lightweight laptop from Apple. MacBook Air features up to 8GB of memory, a    fifth-generation Intel Core processor, Thunderbolt 2, great built-in apps, and all-day battery life.1 Its thin,    light, and durable enough to take everywhere you go-and powerful enough to do everything once you get there,    better.",
    "rating": 4,
    "price": 999.99,
    "quantity": 35,
    "category": "Laptop"
  },
  {
    "name": "OneOdio A71 Wired Headphones",
    "description": "Omnidirectional detachable boom mic upgrades the headphones into a professional headset for gaming, business,    podcasting and taking calls on the go. Better pick up your voice. Control most electric devices through voice    activation, or schedule a ride with Uber and order a pizza. OneOdio A71 Wired Headphones voice-controlled device    turns any home into a smart device on a smartphone or tablet.",
    "rating": 3,
    "price": 49.99,
    "quantity": 69,
    "category": "Laptop Accessories"
  },
  {
    "name": "Apple iMac 27-inch",
    "description": "The all-in-one for all. If you can dream it, you can do it on iMac. It’s beautifully & incredibly intuitive and    packed with tools that let you take any idea to the next level. And the new 27-inch model elevates the    experience in way, with faster processors and graphics, expanded memory and storage, enhanced audio and video    capabilities, and an even more stunning Retina 5K display. It’s the desktop that does it all — better and faster    than ever.",
    "rating": 4,
    "price": 999.99,
    "quantity": 35,
    "category": "Laptop"
  },
  {
    "name": "Apple iPhone 11 (64GB, Black)",
    "description": "The Apple iPhone 11 is a great smartphone, which was loaded with a lot of quality features. It comes with a    waterproof and dustproof body which is the key attraction of the device. The excellent set of cameras offer    excellent images as well as capable of recording crisp videos. However, expandable storage and a fingerprint    scanner would have made it a perfect option to go for around this price range.",
    "rating": 5,
    "price": 669.99,
    "quantity": 70,
    "category": "Mobile Phone"
  },
  {
    "name": "Apple Watch Series 5",
    "description": "On Retina display that never sleeps, so it’s easy to see the time and other important information, without    raising or tapping the display. New location features, from a built-in compass to current elevation, help users    better navigate their day, while international emergency calling1 allows customers to call emergency services    directly from Apple Watch in over 150 countries, even without iPhone nearby. Apple Watch Series 5 is available    in a wider range of materials, including aluminium, stainless steel, ceramic and an all-new titanium.",
    "rating": 4,
    "price": 339.99,
    "quantity": 55,
    "category": "Smart Watch"
  }
]
